In [10]:
import seaborn as sns
df = sns.load_dataset("titanic")
nan_deck = df['deck'].value_counts(dropna=False)
print(nan_deck)
print(df.head().isnull())
print(df.head().notnull())
print(df.isnull().sum(axis=0))

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64
   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False
   survived  pclass   sex   age  sibsp  parch  fare  embarked  class   who  \
0      True    True  True  True   True   True  True      True   True  True
1      True    True  True  True   True   True  True      True   True  True
2      True    True  True  True   True   True  True      True   True  True
3      True    True  True  True   True   True  True      True   True  True
4      True    True  True  True   True   True  True      True   True  True

   adult_male   deck  embark_town  alive  alone
0        True  False         True   True   True
1        True   True         True   True   True
2        True  False         True   True   True
3        True   True         True   True   True
4        True  False         True   True   True
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [15]:
# 누락된 자료가 500개 이상인 자료를 제거
df_1 = df.dropna(axis=1, thresh=500)
"deck" in (df_1.columns)

False

In [20]:
df_2 =  df.dropna(subset=['age'], how='any', axis=0)

In [22]:
print(len(df_2))
len(df) - df['age'].isnull().sum(axis=0)

714

714

In [35]:
# age 열의 NaN값을 다른 나이 데이터의 편균으로 변경하기
mean_age = df['age'].mean(axis=0)
df_age = df['age'].fillna(mean_age)
#임의값으로 수정
df_age_1 = df['age'].fillna(method='ffill')
#가장 빈번하게 나오는 값으로 수정
most_cnt = df['age'].value_counts(dropna=True).idxmax()
df_2 = df['age'].fillna(most_cnt)
df_2

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    24.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [33]:
print(df_age.isnull().sum(axis=0))
len(df_age)

0

891

In [37]:
#중복 데이터 처리
import pandas as pd
#중복 데이터를 갖는 데이터프레임 만들기
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                   'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})
print(df)
print()
df_dup = df.duplicated() # 행의 중복을 체크
print(df_dup)

# 특ㅈ어 열의 중복 체크
df['c1'].duplicated()

# 데이터프레임에서 중복 행을 제거
df2 = df.drop_duplicates()
print(df2)

df2 = df.drop_duplicates(subset=['c2','c3'])
df2

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

0    False
1     True
2    False
3    False
4    False
dtype: bool
  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2